package com.troy.keeper.hbz.app.task;

/**
 * Created by leecheng on 2018/1/3.
 */
public class TaskRemark {

    //TODO *代表代码完成 **测试完成 ***发布接口

    //TODO 用户接单的时间指定接单主体和代理人 ***
    //TODO 订单增加接单时间 ***
    //TODO 运输企业配送完成时添加图片 ***
    //TODO 订单历史查询REST接口 ***
    //TODO 拒签接口 ***
    //TODO 订单添加负责人 ***
    //TODO 车辆征集 - 满10个人订单状态更改为 LOCKED_ORDER 锁定待确认 ***
    //TODO 订单状态增加 待退款 退款中 退款成功 ***
    //TODO 货主订单主动发起退款 ***

    //TODO 用户资质审核，角色授予 ***

    //TODO 添加兑换订单编号 ***
    //TODO 添加兑换订单时间 ***

    //TODO 积分订单发货查询 ***
    //TODO 积分订单发货  ***

    //TODO 生成信誉互评任务 ***
    //TODO 评论任务查询 ***
    //TODO 信誉互评 ***

    //TODO 用户添加、用户禁用、用户查询                           ***
    //TODO 角色添加、角色修改、角色删除、角色查询                  ***
    //TODO 权限添加、权限修改、权限删除、权限查询                  ***
    //TODO 资源添加、资源修改、资源删除、资源查询                  ***
    //TODO 菜单添加、菜单修改、菜单删除、菜单查询                  ***
    //TODO 角色绑定用户、角色绑定权限、角色绑定菜单、资源绑定权限      ***

    //TODO 网点-在Org基本上加上网点字段，以及网点服务区域 ***
    //TODO 网点-依赖找选择服务网点 ***

    //TODO 网点-指派任务给网点  ***
    //TODO 公式规则管理(新增、修改、删除、查询) ***
    //TODO 信誉值变化记录管理 ***
    //TODO 积分值变化记录管理 ***

    //TODO 帮我送公式应用到代码
    //TODO 快递公式应用到代码
    //TODO 整车专线公式应用到代码
    //TODO 临担专线公式应用到代码
    //TODO 货主评价公式应用到代码
    //TODO 车评价公式应用到代码
    //TODO 评价查询列表 **
    //TODO 为评分增加公式
    //TODO 积分兑换订单添加区域

    //TODO 整车、零担专线添加车长字段，整车需要验证
    //TODO 专线运输添加图片上传字段功能
    //TODO 个人司机认证增加交强险照片字段

    //TODO 跑任务更改用户的星级
    //TODO 生成消费积分，订单成交接口
    //TODO URL查询增加权限 ***

    //TODO 服务端评星查询 **
    //TODO 权限以及加state启用禁用 ***

    //TODO 管理端查询待退款定单 - 查询
    //TODO 管理退款订单 - 创建退款单

    //TODO 登录后返回用户信息属性 ***
    //TODO 退款列表
    //TODO 保证金判断条件

    //TODO 订单消費完成积分增加功能
    //TODO 用户头像、积分、昵称、手机号
}
